# 3. Написать программу, которая будет запрашивать у пользователя две строки с помощью инпутов, а затем производить их конкатенацию.
str1 = input("Введите первую строку: ")
str2 = input("Введите вторую строку: ")

result = str1 + str2
print("Результат конкатенации:", result)