#4. Площадь прямоугольника. Написать программу, которая будет запрашивать у пользователя длину и ширину прямоугольника, а затем вычислять площадь.
length = float(input("Введите длину прямоугольника: "))
width = float(input("Введите ширину прямоугольника: "))

area = length * width
print("Площадь прямоугольника:", area)
print();