# 3. Написать программу, которая будет запрашивать у пользователя две строки с помощью инпутов, а затем производить их конкатенацию.
str1 = input("Введите первую строку: ")  # Первая строка
str2 = input("Введите вторую строку: ")  # Вторая строка

result = str1 + str2  # Соединение строк
print("Результат конкатенации:", result)  # Вывод результата