#4. Площадь прямоугольника. Написать программу, которая будет запрашивать у пользователя длину и ширину прямоугольника, а затем вычислять площадь.
length = float(input("Введите длину прямоугольника: "))  # Получаем длину
width = float(input("Введите ширину прямоугольника: "))  # Получаем ширину

area = length * width  # Вычисление площади
print("Площадь прямоугольника:", area)  # Вывод результата
print()  # Пустая строка
